УТ.УчетЗадач/src/Documents/cbr_Задача/cbr_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>cbr_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.cbr_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.cbr_Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетКонтроляПоЗавершению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.cbr_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ.УчетЗадач/src/InformationRegisters/cbr_ПользовательскиеНастройки/cbr_ПользовательскиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ПользовательскиеНастройки</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.cbr_ВидыПользовательскихНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНастройки</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.cbr_ВидыПользовательскихНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/Enums/cbr_ПодпискаДляТриггера/cbr_ПодпискаДляТриггера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ПодпискаДляТриггера</name>
  <enumValues>
    <name>ПроведениеДокументаЗадача</name>
  </enumValues>
  <enumValues>
    <name>ПриСозданииНаСервереФормыЗадачи</name>
  </enumValues>
  <enumValues>
    <name>КнопкаЗакрытияЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаВопросПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВопросаПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗадание</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Documents/cbr_Задача/ObjectModule.bsl
#Область ОбработчикиСобытий
//@skip-check module-accessibility-at-client
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.ТекущийПользователь; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_ПользовательскиеНастройки.Значение,
		|	Центр_ПользовательскиеНастройки.ВидНастройки
		|ИЗ
		|	РегистрСведений.cbr_ПользовательскиеНастройки КАК Центр_ПользовательскиеНастройки
		|ГДЕ
		|	Центр_ПользовательскиеНастройки.Пользователь = &Пользователь
		|	И
		|		Центр_ПользовательскиеНастройки.ВидНастройки.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.НачальноеЗаполнениеЗадачи)
		|	И НЕ Центр_ПользовательскиеНастройки.ВидНастройки.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Пользователь", Автор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидНастройки = ПредопределенноеЗначение("ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.ВидЗадачи") Тогда
			ВидЗадачи = Выборка.Значение;	
		КонецЕсли;
		Если Выборка.ВидНастройки = ПредопределенноеЗначение("ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Постановщик") Тогда
			Постановщик = Выборка.Значение;
			Если ТипЗнч(Постановщик) = Тип("СправочникСсылка.Партнеры") Тогда
				ГлавныйМенеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Постановщик, "ОсновнойМенеджер");
			КонецЕсли;
		КонецЕсли;
		Если Выборка.ВидНастройки = ПредопределенноеЗначение("ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Приоритет") Тогда
			Приоритет = Выборка.Значение;
		КонецЕсли;
		Если Выборка.ВидНастройки = ПредопределенноеЗначение("ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.КонтрольВремени") Тогда
			КонтрольВремени = Выборка.Значение;
		КонецЕсли;
		Если Выборка.ВидНастройки = ПредопределенноеЗначение("ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.УчетВремени") Тогда
			УчетВремени = Выборка.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//@skip-check module-accessibility-at-client
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	cbr_ОбработкаТриггеров.ВызовТриггера(Перечисления.cbr_ПодпискаДляТриггера.ПроведениеДокументаЗадача, Ссылка);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипЗнч(Постановщик) <> Тип("СправочникСсылка.Партнеры") Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("ГлавныйМенеджер");
		ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
